app/views/users/_form.html.erb

SELECT "nutritions".* FROM "nutritions"
---
    <%= f.label :nutrition_id, "Nutrition Plan" %>
    <%= f.collection_select :nutrition_id, Nutrition.all, :id, :name, :class => "form-control", :required => true, :include_blank => true %>