app/views/meals/complete.html.erb

                <td><%= @meal.carb_guess %></td>
                <td><%= @meal.foods.sum(:carb_amount).round(1) %></td>
---
SELECT SUM("foods"."carb_amount") FROM "foods" WHERE "foods"."meal_id" = $1

                <td><%= @meal.protein_guess %></td>
                <td><%= @meal.foods.sum(:protein_amount).round(1) %></td>
---
SELECT SUM("foods"."protein_amount") FROM "foods" WHERE "foods"."meal_id" = $1

                <td><%= @meal.fat_guess %></td>
                <td><%= @meal.foods.sum(:fat_amount).round(1) %></td>
---
SELECT SUM("foods"."fat_amount") FROM "foods" WHERE "foods"."meal_id" = $1