app/views/meals/complete.html.erb

        <p>
          <% @meal.foods.each do |food| %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."meal_id" = $1

                <td><%= @meal.carb_guess %></td>
                <td><%= @meal.foods.sum(:carb_amount).round(1) %></td>
                <td><%= number_to_percentage((@meal.foods.sum(:carb_amount)-(@meal.carb_guess)).round(1)/@meal.carb_guess*100, precision: 1) %></td>
---
SELECT SUM("foods"."carb_amount") FROM "foods" WHERE "foods"."meal_id" = $1

                <td><%= @meal.protein_guess %></td>
                <td><%= @meal.foods.sum(:protein_amount).round(1) %></td>
                <td><%= number_to_percentage((@meal.foods.sum(:protein_amount)-(@meal.protein_guess)).round(1)/@meal.protein_guess*100, precision: 1) %></td>
---
SELECT SUM("foods"."protein_amount") FROM "foods" WHERE "foods"."meal_id" = $1

                <td><%= @meal.fat_guess %></td>
                <td><%= @meal.foods.sum(:fat_amount).round(1) %></td>
                <td><%= number_to_percentage((@meal.foods.sum(:fat_amount)-(@meal.fat_guess)).round(1)/@meal.fat_guess*100, precision: 1) %></td>
---
SELECT SUM("foods"."fat_amount") FROM "foods" WHERE "foods"."meal_id" = $1