app/views/meals/show.html.erb

SELECT "foods".* FROM "foods" WHERE "foods"."meal_id" = $1
---

<% @meal.foods.each do |food| %>