app/controllers/foods_controller.rb

INSERT INTO "foods" ("meal_id", "name", "carb_amount", "fat_amount", "protein_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def food_to_meal
    # url = "https://api.nutritionix.com/v1_1/item?id=#{ params[:selected_food] }&appId=92a57023&appKey=5a11032e7168104fdfa242bd3b62e636"
    # raw_data = HTTParty.get url
    # parsed_data = JSON.parse(raw_data.body)

    q = params[:quantity].to_f
    carb_amount = params[:carb_amount].to_f * q
    fat_amount = params[:fat_amount].to_f * q
    protein_amount = params[:protein_amount].to_f * q
    #@food = Food.new
    @meal = params[:meal_id]
    @food = Food.new
    @food.meal_id = @meal
    @food.name = params[:item_name]
    @food.carb_amount = carb_amount
    @food.fat_amount = fat_amount
    @food.protein_amount = protein_amount
    @food.save