app/controllers/foods_controller.rb

  def create
    # @name = params[:name]

  url = "https://api.nutritionix.com/v1_1/search/#{ params[:name] }?results=0:3&fields=item_name,brand_name,item_id,brand_id,nf_serving_size_qty,nf_serving_size_unit&appId=92a57023&appKey=5a11032e7168104fdfa242bd3b62e636"
  raw_data = HTTParty.get url
  parsed_data = JSON.parse(raw_data.body)
  @food_data = parsed_data['hits']
<<<<<<< HEAD:app/controllers/foods_controller.rb
---
INSERT INTO "foods" ("name", "serving_size", "quantity", "meal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "chicken"], ["serving_size", "cup"], ["quantity", 1.0], ["meal_id", 75], ["created_at", "2015-02-09 01:37:36.711137"], ["updated_at", "2015-02-09 01:37:36.711137"]]