app/controllers/meals_controller.rb

INSERT INTO "meals" ("meal_type", "meal_date", "protein_guess", "carb_guess", "fat_guess", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    meal = @current_user.meals.create(meal_params)

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT 1
---
  def show
    @meal = Meal.find params[:id]

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT 1
---
  def complete
    @meal = Meal.find params[:meal_id]

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT 1  [["id", 67]]
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 67]]
---
  def destroy
    meal = Meal.find params[:id]
    meal.destroy