app/controllers/nutritions_controller.rb

  def index
    @nutritions = Nutrition.all
---
SELECT "nutritions".* FROM "nutritions"