app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
  def home
    @user = User.find session[:user_id] if session[:user_id].present?