app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1
---
  def create
  user = User.find_by :name => params[:username]