app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def edit
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1

  def update
    user = User.find params[:id]
    if user.update user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1
UPDATE "users" SET "nutrition_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3

  def show
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1