eatwhat/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1
---
  def authenticate
  if session[:user_id].present?
  @current_user = User.find_by :id => session[:user_id]
      end
      session[:user_id] = nil unless @current_user.present?